app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 6]]
---
<ul>
<% Micropost.where(user_id: @user.id).each do |micropost| %>