app/views/microposts/_form.html.erb

    <%= f.label :user_id %>
    <!-- <%= f.select :user_id, options_for_select(User.first.id..User.last.id) %> -->
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]