app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"

  def new
    @micropost = Micropost.new
    @all_users = User.all
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sfsdf"], ["user_id", 1], ["created_at", 2016-09-08 14:13:29 UTC], ["updated_at", 2016-09-08 14:13:29 UTC]]

  def destroy
    @micropost.destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 2]]

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]